<?php
?>
<!DOCTYPE html>
<html>
<head>
    <title>homework3</title>
    <meta charset="UTF-8">
</head>
<body>
Intro PHP. Homework #3 <br>
Nick Nikulin, dated 10.10.2019. <br>
Teacher, Oleg Arestov. <br>
1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.<br>
<br>
2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:<br>
<br>
0 – ноль.<br>
1 – нечетное число.<br>
2 – четное число.<br>
3 – нечетное число.<br>
…<br>
10 – четное число.<br>
3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,<br>
а в качестве значений – массивы с названиями городов из соответствующей области.<br>
Вывести в цикле значения массива, чтобы результат был таким:<br>
<br>
Московская область:<br>
Москва, Зеленоград, Клин<br>
Ленинградская область:<br>
Санкт-Петербург, Всеволожск, Павловск, Кронштадт<br>
Рязанская область … (названия городов можно найти на maps.yandex.ru)<br>
4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие<br>
латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).<br>
<br>
Написать функцию транслитерации строк. Должны обрабатываться корректно заглавные и знаки препинания, исходный массив<br>
расширять нельзя.<br>
5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.<br>
<br>
6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP. Необходимо представить <br>
пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю?<br>
Попробовать его реализовать. ВАЖНОЕ<br>
<br>
7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так:<br>
<br>
for (…){ // здесь пусто}<br>
8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».<br>
<br>
9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит<br>
транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на<br>
основе названия статьи в блогах).<br>
</body>
</html>